In [30]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [31]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

In [32]:
page = requests.get(url)

In [33]:
soup = BeautifulSoup(page.text,'html')

In [34]:
# print(soup.prettify())

In [35]:
table = soup.find_all('table', class_=['wikitable', 'sortable', 'jquery-tablesorter'])[0] #table extraction

In [36]:
# print(table.prettify())

In [37]:
headers = table.find_all('th') #header extraction

In [38]:
table_headers = [heading.text.strip() for heading in headers]

In [39]:
print(table_headers)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [40]:
df = pd.DataFrame(columns = table_headers)

In [41]:
df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [42]:
data_rows = table.find_all('tr')

In [43]:
for row in data_rows:
    row_data = row.find_all('td')
    if row_data:
        individual_row = [data.text.strip() for data in row_data]
        length = len(df)
        df.loc[length] = individual_row

In [44]:
df.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"648,125",6.0%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"574,785",11.9%,"1,525,000","Seattle, Washington"
2,3,Apple,Electronics industry,"383,482",-2.8%,"161,000","Cupertino, California"
3,4,UnitedHealth Group,Healthcare,"371,622",14.6%,"440,000","Minnetonka, Minnesota"
4,5,Berkshire Hathaway,Conglomerate,"364,482",20.7%,"396,500","Omaha, Nebraska"

In [45]:
df.tail()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
95,96,TIAA,Financials,"45,735",11.8%,"16,023","New York City, New York"
96,97,CHS,Agriculture cooperative,"45,590",-4.6%,"10,609","Inver Grove Heights, Minnesota"
97,98,Bristol-Myers Squibb,Pharmaceutical industry,"45,006",-2.5%,"34,100","New York City, New York"
98,99,Dow Chemical Company,Chemical industry,"44,622",-21.6%,"35,900","Midland, Michigan"
99,100,Best Buy,Retail,"43,452",-6.1%,"85,000","Richfield, Minnesota"

In [46]:
df.isna().sum()

Rank                      0
Name                      0
Industry                  0
Revenue (USD millions)    0
Revenue growth            0
Employees                 0
Headquarters              0
dtype: int64

In [47]:
df.isnull().sum()

Rank                      0
Name                      0
Industry                  0
Revenue (USD millions)    0
Revenue growth            0
Employees                 0
Headquarters              0
dtype: int64

In [48]:
df.duplicated().sum()

0

In [49]:
df.shape

(100, 7)

In [50]:
df.dtypes

Rank                      object
Name                      object
Industry                  object
Revenue (USD millions)    object
Revenue growth            object
Employees                 object
Headquarters              object
dtype: object

In [51]:
df.columns = df.columns.str.replace(' ', '_')

In [52]:
df.head()

,Rank,Name,Industry,Revenue_(USD_millions),Revenue_growth,Employees,Headquarters
0,1,Walmart,Retail,"648,125",6.0%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"574,785",11.9%,"1,525,000","Seattle, Washington"
2,3,Apple,Electronics industry,"383,482",-2.8%,"161,000","Cupertino, California"
3,4,UnitedHealth Group,Healthcare,"371,622",14.6%,"440,000","Minnetonka, Minnesota"
4,5,Berkshire Hathaway,Conglomerate,"364,482",20.7%,"396,500","Omaha, Nebraska"

In [53]:
df = df.apply(lambda x: x.str.strip() if x.dtype == "object" else x) #trimming

In [54]:
#data type conversion
df['Revenue_growth'] = df['Revenue_growth'].str.replace('%','').astype(float)
df['Revenue_(USD_millions)'] = df['Revenue_(USD_millions)'].str.replace(',','').astype(int)
df['Employees'] = df['Employees'].str.replace(',','').astype(int)
df['Rank'] = df['Rank'].astype(int)

In [55]:
df.head()

,Rank,Name,Industry,Revenue_(USD_millions),Revenue_growth,Employees,Headquarters
0,1,Walmart,Retail,648125,6.0,2100000,"Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,574785,11.9,1525000,"Seattle, Washington"
2,3,Apple,Electronics industry,383482,-2.8,161000,"Cupertino, California"
3,4,UnitedHealth Group,Healthcare,371622,14.6,440000,"Minnetonka, Minnesota"
4,5,Berkshire Hathaway,Conglomerate,364482,20.7,396500,"Omaha, Nebraska"

In [56]:
df.dtypes

Rank                        int64
Name                       object
Industry                   object
Revenue_(USD_millions)      int64
Revenue_growth            float64
Employees                   int64
Headquarters               object
dtype: object

In [28]:
df.to_csv('companies_revenue.csv',index = False)

In [57]:
df.max()

Rank                                           100
Name                      World Kinect Corporation
Industry                            Transportation
Revenue_(USD_millions)                      648125
Revenue_growth                               125.9
Employees                                  2100000
Headquarters              Woonsocket, Rhode Island
dtype: object